Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: འཇིག་པ་མེད་པའི་ཕྱིར་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། ཕྱོགས་མཚམས་བཞི་སྟེ། ཕྱོགས་དེ་བརྒྱད་ཀྱང་དེ་བཞིན་ནོ། །སྟེང་གི་ཕྱོགས་ནི་སྟེང་གི་ཕྱོགས་ཀྱིས་སྟོང་ངོ་། །འོག་གི་ཕྱོགས་ཀྱང་འོག་གི་ཕྱོགས་ཀྱིས་སྟོང་ངོ་། །
en: The southern, western, northern, and four intermediate directions—all eight—are also similarly empty of themselves, and the zenith is empty of the zenith, while the nadir is empty of the nadir, because they do not endure and do not disintegrate.

source: དེ་ནི་ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of great extent.

source: དེ་ལ་དོན་དམ་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། དོན་དམ་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ལ་དོན་དམ་པ་ཞེས་བྱ་བ་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་སྟེ།
en: “If you ask what is the ‘emptiness of ultimate reality,’ the term ‘ultimate reality’ denotes nirvāṇa in the context of the ‘emptiness of ultimate reality.’

source: དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ནི་མྱ་ངན་ལས་འདས་པས་སྟོང་ངོ་། །
en: In this regard, nirvāṇa is empty of nirvāṇa because it does not endure and does not disintegrate.

source: དེ་ནི་དོན་དམ་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །དེ་ལ་འདུས་བྱས་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་བྱས་ཞེས་བྱ་བ་ནི་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་།
en: That is called the emptiness of ultimate reality.

source: གཟུགས་མེད་པའི་ཁམས་ཏེ། དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་འདོད་པའི་ཁམས་ནི་འདོད་པའི་ཁམས་ཀྱིས་སྟོང་ངོ་། །དེ་བཞིན་དུ་གཟུགས་ཀྱི་ཁམས་ནི་གཟུགས་ཀྱི་ཁམས་ཀྱིས་སྟོང་ངོ་། །གཟུགས་མེད་པའི་ཁམས་ནི་གཟུགས་མེད་པའི་ཁམས་ཀྱིས་སྟོང་ངོ་། །
en: “If you ask what is the ‘emptiness of conditioned phenomena,’ this refers to the world system of desire, the world system of form, and the world system of formlessness, among which the world system of desire is empty of the world system of desire, and similarly, the world system of form is empty of the world system of form, and the world system of formlessness is empty of the world system of formlessness because they do not endure and do not disintegrate.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, it is because it is their very nature.

source: དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ་དེ་ནི་འདུས་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of conditioned phenomena.

source: དེ་ལ་འདུས་མ་བྱས་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་མ་བྱས་ཞེས་བྱ་བ་ནི་ཆོས་གང་ལ་སྐྱེ་བ་མེད་པ་དང་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དང་གཞན་དུ་འགྱུར་བ་མེད་པ་སྟེ།
en: “If you ask what is the ‘emptiness of unconditioned phenomena,’ the term ‘unconditioned phenomena’ denotes anything that does not arise, that does not abide, that does not disintegrate, and that does not change into something else.

source: དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་འཇིག་པ་མེད་པའི་ཕྱིར་འདུས་མ་བྱས་ནི་འདུས་མ་བྱས་ཀྱིས་སྟོང་ངོ་། །
en: In this regard, unconditioned phenomena are empty of unconditioned phenomena because they do not endure and do not disintegrate.

source: དེ་ནི་འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of unconditioned phenomena.

source: དེ་ལ་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་རྣམ་པར་འཇིག་པ་མེད་པའི་ཕྱིར་ཆོས་གང་ལ་སྐྱེ་བ་ཤིན་ཏུ་མི་དམིགས་པའོ། །
en: “If you ask what is the ‘emptiness of the unlimited,’ the arising of anything [which has no limits] is utterly non-apprehensible because it does not endure and does not disintegrate.

source: དེ་ནི་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of the unlimited.

source: དེ་ལ་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་འཇིག་པ་མེད་པའི་ཕྱིར་ཆོས་གང་ལ་འོང་བ་མི་དམིགས་པའོ། །
en: “If you ask what is the ‘emptiness of that which has neither beginning nor end,’ the coming to pass of anything [in cyclic existence that has no beginning or end] is utterly non-apprehensible because it does not endure and does not disintegrate.

source: དེ་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of that which has neither beginning nor end.

source: དེ་ལ་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་།
en: “If you ask what is the ‘emptiness of non-dispersal,’ this denotes anything in which there is no dispersion.

source: འཇིག་པ་མེད་པའི་ཕྱིར་གང་ལ་ཆོས་གང་ཡང་དོར་དུ་མེད་པའོ། །
en: [Things are empty of non-dispersal] because they do not endure and do not disintegrate.

source: དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ་དེ་ནི་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of non-dispersal.

source: དེ་ལ་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་གང་ཞེ་ན།
en: “If you ask what is the ‘emptiness of inherent existence,’ this denotes the true nature of all conditioned and unconditioned phenomena, which is not created by the śrāvakas, not created by the pratyekabuddhas, and not fashioned by the lord buddhas.

source: ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་འཇིག་པ་མེད་པའི་ཕྱིར་འདུས་བྱས་སམ། འདུས་མ་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་ཉན་ཐོས་རྣམས་ཀྱིས་མ་བྱས་རང་སངས་རྒྱས་རྣམས་ཀྱིས་མ་བྱས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མ་བྱས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་མ་མཛད་པའོ། །
en: [Inherent existence is empty of inherent existence] because it does not endure and does not disintegrate.

source: དེ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of inherent existence.

source: དེ་ལ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། རང་གི་མཚན་ཉིད་ཅེས་བྱ་བ་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་ནི་གཟུགས་སུ་རུང་བ། ཚོར་བའི་མཚན་ཉིད་ནི་མྱོང་བ། འདུ་ཤེས་ཀྱི་མཚན་ཉིད་ནི་ཀུན་ཏུ་ཤེས་པར་བྱེད་པ། འདུ་བྱེད་རྣམས་ཀྱི་མཚན་ཉིད་ནི་མངོན་པར་འདུ་བྱེད་པ།
en: “If you ask what is the ‘emptiness of all intrinsic defining characteristics,’ this denotes the intrinsic defining characteristic of physical forms, which is the capacity to assume physical forms; the intrinsic defining characteristic of feelings, which is emotional experience; the intrinsic defining characteristic of perceptions, which is comprehensibility; the intrinsic defining characteristic of formative predispositions which is conditioning; and the intrinsic defining characteristic of consciousness, which is cognizance.

source: རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་ནི་རྣམ་པར་ཤེས་པར་བྱེད་པ་སྟེ། འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: It applies to the defining characteristics of conditioned phenomena [such as these], and similarly extends as far as the defining characteristics of unconditioned phenomena.

source: ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་མཚན་ཉིད་དེ་དག་ཐམས་ཅད་ནི་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་ངོ་། །
en: All these intrinsic defining characteristics are empty of their own intrinsic defining characteristics because they do not endure and do not disintegrate.

source: དེ་ནི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of intrinsic defining characteristics.

source: དེ་ལ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་ཕུང་པོ་ལྔ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་དང་། ཆོས་གཟུགས་ཅན་རྣམས་དང་། གཟུགས་མེད་པའི་ཆོས་རྣམས་དང་།
en: “If you ask what is the ‘emptiness of all things,’ the term ‘all things’ denotes the five psycho-physical aggregates, the twelve sense fields, the eighteen sensory elements, corporeal phenomena, formless phenomena, conditioned phenomena, and unconditioned phenomena.

source: འདུས་བྱས་ཀྱི་ཆོས་རྣམས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཏེ། དེ་ལ་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ངོ་། །
en: All such things are empty of all things because they do not endure and do not disintegrate.

source: དེ་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of all things.

source: དེ་ལ་མི་དམིགས་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན།
en: “If you ask what is the ‘emptiness of non-apprehension,’ it is that which does not apprehend any phenomena at all.

source: དེ་ཡང་ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མི་དམིགས་པ་གང་ཡིན་པའོ། །
en: [Non-apprehension is empty of non-apprehension] because it does not endure and does not disintegrate.

source: དེ་ནི་མི་དམིགས་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of non-apprehension.

source: དེ་ལ་དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། གང་ལ་དངོས་པོ་འགའ་ཡང་མི་དམིགས་པ་སྟེ།
en: “If you ask what is the ‘emptiness of non-entities,’ it is the non-apprehension of any entity, in anything whatsoever.

source: དེ་ནི་དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: This is called the emptiness of non-entities.

source: དེ་ལ་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་པ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་གང་ཡང་མེད་པ་སྟེ།
en: “If you ask what is the ‘emptiness of essential nature,’ it is the absence of any essential nature with respect to anything originating from combinations [of causes and conditions].

source: དེ་ནི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of essential nature.

source: དེ་ལ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་པ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་འགའ་ཡང་མེད་པ་སྟེ།
en: “If you ask what is the ‘emptiness of the essential nature of non-entities,’ it [too] is the absence of any essential nature in anything originating from combinations [of causes and conditions].

source: དེ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the emptiness of the essential nature of non-entities.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་དངོས་པོ་ནི་དངོས་པོས་སྟོང་ངོ་།།
en: “Moreover, Śāradvatī­putra, entities are empty of entities.

source: དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་སྟོང་ངོ་། །
en: Non-entities are empty of non-entities.

source: ངོ་བོ་ཉིད་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་། །
en: Essential nature is empty of essential nature.

source: གཞན་གྱི་དངོས་པོ་ནི་གཞན་གྱི་དངོས་པོས་སྟོང་ངོ་། །དེ་ལ་དངོས་པོ་གང་ཞེ་ན།
en: Extraneous entities are empty of extraneous entities.

source: དངོས་པོ་ཞེས་བྱ་བ་ནི་ཕུང་པོ་ལྔ་པོ་རྣམས་ཏེ། འདི་ལྟ་སྟེ། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: “If you ask what are entities, the term ‘entities’ denotes the five psycho-physical aggregates, which comprise physical forms, feelings, perceptions, formative predispositions, and consciousness.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟེ། དེ་ལ་དངོས་པོ་ནི་དངོས་པོས་སྟོང་ངོ་། །
en: In this regard, entities are empty of entities.

source: ཇི་ལྟར་ན་དངོས་པོ་མེད་པ་དངོས་པོ་མེད་པས་སྟོང་ཞེ་ན།
en: “If you ask in what way non-entities are empty of non-entities, the term ‘non-entities’ denotes unconditioned phenomena.

source: དངོས་པོ་མེད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་པ་སྟེ། དེ་ལ་འདུས་མ་བྱས་པ་ནི་འདུས་མ་བྱས་ཀྱིས་སྟོང་ངོ་། །
en: In this regard unconditioned phenomena are empty of unconditioned phenomena.

source: དེ་བཞིན་དུ་དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་སྟོང་ངོ་། །
en: Similarly, non-entities are empty of non-entities.

source: ཇི་ལྟར་ན་ངོ་བོ་ཉིད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ཞེ་ན། ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཤེས་པས་ཀྱང་མ་བྱས། མཐོང་བས་ཀྱང་མ་བྱས། གང་གིས་ཀྱང་མ་བྱས་པ་སྟེ།
en: “If you ask in what way the essential nature is empty of the essential nature, the essential nature of all phenomena is not created by being known, it is not created by being seen, and it is not created by anything at all.

source: དེ་ནི་ངོ་བོ་ཉིད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱའོ། །
en: In this way, the essential nature is said to be empty of the essential nature.

source: ཇི་ལྟར་ན་གཞན་གྱི་དངོས་པོ་གཞན་གྱི་དངོས་པོས་སྟོང་ཞེ་ན། གང་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་། ཆོས་རྣམས་ཀྱི་ཆོས་གནས་པ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་།
en: “If you ask in what way extraneous entities are empty of extraneous entities, whether the tathāgatas have appeared or whether the tathāgatas have not appeared, the abiding nature of all things, the expanse of reality, the maturity with respect to all things, the real nature, the incontrovertible real nature, the inalienable real nature, and the finality of existence—all of these continue to abide.

source: ཕྱིན་ཅི་མ་ལོག་པ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ནི་གནས་པ་ཉིད་དེ། ཆོས་འདི་དག་གི་གཞན་གྱི་སྟོང་པ་གང་ཡིན་པ་དེ་ནི་གཞན་གྱི་དངོས་པོ་གཞན་གྱི་དངོས་པོས་སྟོང་པ་ཞེས་བྱ་སྟེ།
en: Anything that is empty of phenomena extraneous to these attributes may be called an extraneous entity that is empty of extraneous entities.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མངོན་པར་ཞེན་པར་མི་བྱ་བའི་ཆོས་ཐམས་ཅད་ནི་དེ་དག་ཡིན་ནོ། །
en: “Śāradvatī­putra! These are all attributes with respect to which a great bodhisattva being should cultivate detachment.

source: མངོན་པར་ཞེན་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཡིན་ཞིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།།
en: One who is without fixation will reach the transcendent perfection of wisdom, and swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས། གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་དང་པོའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་གཉིས་པ།
en: This completes the first chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “The Context.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པས་གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས། གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་རྣམས་དང་། ལས་ཡང་དག་པར་ལེན་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་གནས་ཀྱི་སྒོ་དང་། རྒྱུའི་སྒོ་ནས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དུམ་པ། ཁམས་སྣ་ཚོགས་པ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། དེས་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་མོས་པ་སྣ་ཚོགས་ཉིད་དང་། མོས་པ་དུ་མ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། དེས་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། རྣམ་པར་ཐར་པ་དང་། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་།
en: All Phenomena Chapter 2 Then, once again, the Blessed One addressed the venerable Śāradvatī­putra in the following words, “Śāradvatī­putra, if you ask what are the ‘ten powers of the tathāgatas,’ they are as follows: (1) definitive knowledge that things which are possible are indeed possible; (2) definitive knowledge that things which are impossible are indeed impossible; (3) definitive knowledge, through possibilities and causes, of the maturation of past, future, and present actions, and of those who undertake such actions; (4) definitive knowledge of multiple world systems and diverse dispositions; (5) definitive knowledge of the diversity of inclinations and the multiplicity of inclinations that other sentient beings and other individuals have; (6) definitive knowledge of whether the acumen of other sentient beings and other individuals is supreme or not; (7) definitive knowledge of the paths that lead anywhere; (8) definitive knowledge of all the afflicted and purified mental states and their emergence, with respect to the faculties, powers, branches of enlightenment, aspects of liberation, meditative concentrations, meditative stabilities, and formless absorptions; (9) definitive knowledge of the recollection of multiple past abodes, and of the transference of consciousness at the death and birth of all sentient beings; and (10) definitive knowledge that through one’s own extrasensory powers one has actualized, achieved, and maintained in this very lifetime the liberation of mind and the liberation of wisdom in the state that is free from contaminants because all contaminants have ceased, and so one can say, ‘My rebirths have come to an end.

source: སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། ཟག་པ་རྣམས་ཟད་པས་ཟག་པ་མེད་པར་སེམས་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་རབ་རྣམ་པར་གྲོལ་བའི་ཚེ་འདི་ཉིད་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ནས་བསྒྲུབས་ཏེ་གནས་ཤིང་བདག་གི་སྐྱེ་བ་ནི་ཟད་དོ། །
en: I have practiced chastity.

source: ཚངས་པར་སྤྱོད་པ་ནི་སྤྱད་དོ། །བདག་གི་བྱ་བ་ནི་བྱས་སོ། །
en: I have fulfilled my duties.

source: སྲིད་པ་ནི་འདི་ལས་གཞན་མི་ཤེས་སོ་ཞེས་བྱ་བ་སྟེ།
en: I will experience no other rebirths apart from this one.’

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡིན་ནོ། །
en: Śāradvatī­putra, these are called the ten powers of the tathāgatas.

source: ཤཱ་ར་དྭ་ཏིའི་བུ་དེ་ལ་མི་འཇིགས་པ་བཞི་གང་ཞེ་ན། ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་དམ་བཅས་པ་ན། འདིར་ཆོས་འདི་དག་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སོ་ཞེས་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུ་ཡང་རུང་བ་འགའ་ཞིག་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་བདག་ལ་རྒོལ་བའི་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: “Śāradvatī­putra, if you ask what are the ‘four assurances’ [proclaimed by the tathāgatas], they are as follows: “ (1) When I claim to have attained genuinely perfect buddhahood, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else should say that I have not attained manifestly perfect buddhahood with respect to these particular phenomena here, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: ངས་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་བདེ་བ་ཐོབ་སྟེ།
en: By correctly disregarding that reason, I have found happiness and abide therein.

source: གནས་ཤིང་བག་ཚ་བ་མེད་པ་ཐོབ་ལ་མི་འཇིགས་པ་ཐོབ་སྟེ།
en: To have attained this absence of trepidation is to have attained fearlessness.

source: གནས་ཀྱིས་ཁྱུ་མཆོག་རླབས་པོ་ཆེའི་གནས་སུ་དམ་བཅའོ། །
en: I claim my exalted place as a great leader.

source: འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་བསྒྲག་གོ། །ཚངས་པའི་འཁོར་ལོ་སྔོན་དགེ་སྦྱོང་ངམ།
en: I will rightly roar the lion’s roar in the midst of the assembly!

source: བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་རབ་ཏུ་བསྐོར་རོ་ཞེས་བྱ་བ་དང་། ང་ཟག་པ་ཟད་དོ་ཞེས་དམ་བཅས་ན་འདིར་ཟག་པ་འདི་དག་མ་ཟད་དོ་ཞེས་དགེ་སྦྱོང་ངམ།
en: I will turn the wheel of Brahmā which has not previously been turned [in the world] in conformity with the sacred doctrine by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else!

source: བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུ་ཡང་རུང་བ་འགའ་ཞིག་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་བདག་ལ་རྒོལ་བའི་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: “ (2) When I claim I am one whose contaminants have ceased, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else should say that these particular contaminants of mine have not ceased, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བར་བསྐོར་རོ་ཞེས་བྱ་བ་དང་། ངས་བར་དུ་གཅོད་པའི་ཆོས་གང་དག་བཤད་པ་དེ་དག་བསྟེན་ཀྱང་བར་དུ་གཅོད་པར་མི་འགྱུར་ཏེ། དེ་ནི་གནས་མེད་དོ་ཞེས་དམ་བཅས་ན་འདིར་དགེ་སྦྱོང་ངམ།
en: I will turn the wheel of Brahmā which has not previously been turned in the world in conformity with the sacred doctrine by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else!

source: བྲམ་ཟེའམ། ལྷའམ། །བདུད་དམ། ཚངས་པའམ། སུ་ཡང་རུང་བ་འགའ་ཞིག་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་བདག་ལ་རྒོལ་བའི་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: “ (3) When I claim to have explained those things which cause obstacles on the path, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else should insist in this respect that even though one might depend on those things, there will be no obstacles and that that would be impossible, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བར་བསྐོར་རོ་ཞེས་བྱ་བ་དང་།
en: I will turn the wheel of Brahmā which has not previously been turned in the world in conformity with the sacred doctrine by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else!

source: ངས་ཉན་ཐོས་རྣམས་ལ་འཕགས་པ་ངེས་པར་འབྱིན་པ་ངེས་པར་འབྱེད་པ་དེ་བྱེད་པ་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བའི་ལམ་གང་བཤད་པ་དེ་བསྒྲུབས་ན། ངེས་པར་འབྱིན་པ་མ་ཡིན་ཞིང་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་མི་འགྱུར་ཏེ། དེ་ནི་གནས་མེད་དོ་ཞེས་འདིར་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ་ཚངས་པའམ། སུ་ཡང་རུང་བ་འགའ་ཞིག་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་རྒོལ་བའི་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: “ (4) When I claim to have explained the path through which suffering will genuinely cease, having ascertained that śrāvakas will find it conducive to the attainment of sublime emancipation, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else in the world should say in this respect that even if one practices this path, it will not be conducive to emancipation, that suffering will not cease, and that that is impossible, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: ངས་རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། བདེ་བ་ཐོབ་སྟེ་གནས་ཤིང་བག་ཚ་བ་མེད་པ་ཐོབ་ལ་མི་འཇིགས་པ་འཐོབ་སྟེ།
en: By correctly disregarding that reason, I have found happiness and abide therein. To have attained this absence of trepidation is to have attained fearlessness.

source: བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་རབ་ཏུ་བསྐོར་རོ་ཞེས་བྱ་བ་སྟེ།
en: I will turn the wheel of Brahmā which has not previously been turned in the world in conformity with the sacred doctrine by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else!

source: དེ་དག་ནི་མི་འཇིགས་པ་བཞི་ཞེས་བྱའོ། །
en: These are called the four assurances.

source: དེ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་།
en: “If you ask what are the ‘four kinds of exact knowledge,’ they comprise (1) exact knowledge of meanings, (2) exact knowledge of dharmas, (3) exact knowledge of their language and lexical explanations, and (4) exact knowledge of their eloquent expression.

source: སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་སྟེ། དེ་དག་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཞེས་བྱའོ། །དེ་ལ་བྱམས་པ་ཆེན་པོ་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་དགྲ་བོ་དང་། མཛའ་བཤེས་ལ་འདྲ་བར་མཛད་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is ‘great loving kindness,’ it is an action in which the tathāgatas engage on behalf of all sentient beings, treating enemies and friends identically.

source: དེ་ནི་བྱམས་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: That is called great loving kindness.

source: དེ་ལ་སྙིང་རྗེ་ཆེན་པོ་གང་ཞེ་ན། སེམས་ཅན་ཡོད་པ་མ་ཡིན་པའི་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་མི་གཏོང་བ་གང་ཡིན་པ་སྟེ།
en: If you ask what is ‘great compassion,’ it is unstinting loving kindness toward all sentient beings, when there are actually no sentient beings.

source: དེ་ནི་སྙིང་རྗེ་ཆེན་པོ་ཞེས་བྱའོ། །དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་བ་མེད་པ་དང་། ཅ་ཅོ་མེད་པ་དང་། བསྙེལ་བ་མེད་པ་དང་། ཐ་དད་པའི་འདུ་ཤེས་མེད་པ་དང་། སེམས་མཉམ་པར་མ་བཞག་པ་མེད་པ་དང་། སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མེད་པ་དང་། འདུན་པ་ཉམས་པ་མེད་པ་དང་། བརྩོན་འགྲུས་ཉམས་པ་མེད་པ་དང་། དྲན་པ་ཉམས་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་པ་དང་། ཤེས་རབ་ཉམས་པ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བ་ཉམས་པ་མེད་པ་དང་།
en: That is called great compassion.
